text = input("Введите ваши данные")
count = 0
count1 = 0
listA = ["A", "a", "E", "e", "I", "i", "O", "o", "U", "u", "Y", "y", "А", "а", "И", "и", "О", "о", "У", "у", "Ы", "ы", "Э", "э"]
listB = ["B", "b", "C", "c", "D", "d", "F", "f", "G", "g", "H", "h", "J", "j", "K", "k", "L", "l", "M", "m", "N", "n", "P", "p", "Q", "q", "R", "r", "S", "s", "T", "t", "V", "v", "X", "x", "Z", "z", "Б", "б", "В", "в", "Г", "г", "Д", "д", "Ж", "ж", "З", "з", "Й", "й", "К", "к", "Л", "л", "М", "м", "Н", "н", "П", "п", "Р", "р", "С", "с", "Т", "т", "Ф", "ф", "Х", "х", "Ц", "ц", "Ч", "ч", "Ш", "ш", "Щ", "щ"]
for i in text:
    if i in listA:
        count += 1
    if i in listB:
        count1 += 1
print("Гласные", count, "Согласные", count1)